tiborsimon/embedded-tdd-headers/pic/8bit/pic12f675_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC12F675_H_
#define _PIC12F675_H_

#define INDF                          0
#define TMR0                          1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define RP0                           11
#define RP                            12
#define RP1                           13
#define IRP                           14
#define FSR                           15
#define GPIO                          16
#define GPIO0                         17
#define GP0                           18
#define GPIO1                         19
#define GP1                           20
#define GPIO2                         21
#define GP2                           22
#define GPIO3                         23
#define GP3                           24
#define GPIO4                         25
#define GP4                           26
#define GPIO5                         27
#define GP5                           28
#define PCLATH                        29
#define INTCON                        30
#define GPIF                          31
#define INTF                          32
#define TMR0IF                        33
#define T0IF                          34
#define GPIE                          35
#define INTE                          36
#define T0IE                          37
#define TMR0IE                        38
#define PEIE                          39
#define GIE                           40
#define PIR1                          41
#define T1IF                          42
#define TMR1IF                        43
#define CMIF                          44
#define ADIF                          45
#define EEIF                          46
#define TMR1L                         47
#define TMR1H                         48
#define T1CON                         49
#define TMR1ON                        50
#define TMR1CS                        51
#define nT1SYNC                       52
#define T1OSCEN                       53
#define T1CKPS0                       54
#define T1CKPS                        55
#define T1CKPS1                       56
#define TMR1GE                        57
#define CMCON                         58
#define CM                            59
#define CM0                           60
#define CM1                           61
#define CM2                           62
#define CIS                           63
#define CINV                          64
#define COUT                          65
#define ADRESH                        66
#define ADCON0                        67
#define ADON                          68
#define nDONE                         69
#define GO_nDONE                      70
#define GO_DONE                       71
#define GO                            72
#define CHS                           73
#define CHS0                          74
#define CHS1                          75
#define VCFG                          76
#define ADFM                          77
#define OPTION_REG                    78
#define PS                            79
#define PS0                           80
#define PS1                           81
#define PS2                           82
#define PSA                           83
#define T0SE                          84
#define T0CS                          85
#define INTEDG                        86
#define nGPPU                         87
#define TRISIO                        88
#define TRISIO0                       89
#define TRISIO1                       90
#define TRISIO2                       91
#define TRISIO3                       92
#define TRISIO4                       93
#define TRISIO5                       94
#define PIE1                          95
#define T1IE                          96
#define TMR1IE                        97
#define CMIE                          98
#define ADIE                          99
#define EEIE                          100
#define PCON                          101
#define nBOR                          102
#define nBOD                          103
#define nPOR                          104
#define OSCCAL                        105
#define CAL0                          106
#define CAL                           107
#define CAL1                          108
#define CAL2                          109
#define CAL3                          110
#define CAL4                          111
#define CAL5                          112
#define WPU                           113
#define WPU0                          114
#define WPU1                          115
#define WPU2                          116
#define WPU4                          117
#define WPU5                          118
#define IOC                           119
#define IOC0                          120
#define IOCB0                         121
#define IOC1                          122
#define IOCB1                         123
#define IOC2                          124
#define IOCB2                         125
#define IOCB3                         126
#define IOC3                          127
#define IOCB4                         128
#define IOC4                          129
#define IOC5                          130
#define IOCB5                         131
#define VRCON                         132
#define VR0                           133
#define VR                            134
#define VR1                           135
#define VR2                           136
#define VR3                           137
#define VRR                           138
#define VREN                          139
#define EEDATA                        140
#define EEADR                         141
#define EECON1                        142
#define RD                            143
#define WR                            144
#define WREN                          145
#define WRERR                         146
#define EECON2                        147
#define ADRESL                        148
#define ANSEL                         149
#define ANS0                          150
#define ANS                           151
#define ANS1                          152
#define ANS2                          153
#define ANS3                          154
#define ADCS0                         155
#define ADCS                          156
#define ADCS1                         157
#define ADCS2                         158

#endif // _PIC12F675_H_
